MMBytes/MultiGeiger-V2/sdkconfig.defaults.adafruit_qtpy_esp32_pico
# ============================================================================
# Adafruit QT Py ESP32-PICO (PID 5395) overlay — ESP32-PICO-V3-02 SiP
# (original ESP32 LX6 dual-core), in-package 8 MB flash + 2 MB SiP PSRAM,
# USB-C via CH9102F or CP2102N UART bridge (NOT native USB).
#
# This is the original ESP32 chip (not S3) — same build path as Heltec V2,
# different memory profile (PSRAM enabled). Pin map and feature flags live
# in main/hal.h under BOARD_ADAFRUIT_QTPY_ESP32_PICO.
# ============================================================================

CONFIG_IDF_TARGET="esp32"

# 8 MB SiP flash. Standard partitions.csv (factory + ota_0 + ota_1, 2 MB each)
# fits trivially — no override needed.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Auto-detect XTAL — PICO modules may report 26 or 40 MHz crystal.
CONFIG_XTAL_FREQ_AUTO=y

# In-package PSRAM. Per ESP32-PICO-V3-02 datasheet, the 2 MB PSRAM is wired
# internally via SDIO (not external QSPI). Use the 32 Mbit type and standard
# clock. CONFIG_SPIRAM_USE_MALLOC joins it to the global heap. The spill
# thresholds and the V2.5.33 network/TLS PSRAM-offload knobs are common to all
# PSRAM boards and live in the shared sdkconfig.defaults "PSRAM heap policy"
# section. PSRAM here is 2 MB @ 40 MHz — ample for net/TLS buffers, just slower
# than the S3 boards' 80 MHz, fine for these non-hot-path allocations.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_ESPPSRAM32=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_MALLOC=y

# V2.5.33: pin the build to rev-3 silicon. Adafruit ships the QT Py ESP32 with
# ESP32-PICO-V3-02 (rev 3), where the original-ESP32 PSRAM cache errata is fixed
# — so IDF drops CONFIG_SPIRAM_CACHE_WORKAROUND (smaller/faster) and the
# PSRAM-resident WiFi/TLS buffers from the shared policy are cache-safe without
# it. A board carrying pre-V3 silicon will refuse to boot (fail-fast) rather
# than risk PSRAM cache corruption.
CONFIG_ESP32_REV_MIN_3=y

# Console / flashing path: UART0 via the CH9102F or CP2102N USB bridge.
# (Original ESP32 has no built-in USB peripheral — USB-C on the QT Py is the
# UART bridge's USB.)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# V2.5.34: ESP-IDF Wi-Fi roaming app — low-RSSI + LEGACY roam, threshold -72,
# periodic-scan + BTM off. PSRAM boards only; recovers from sticky weak-AP after a
# reconnect. Rationale + the reconnect-ownership handoff are documented in full in
# sdkconfig.defaults.feathers3_d. EXPERIMENTAL (IDF_EXPERIMENTAL_FEATURES) —
# bench-validate on one node before fleet OTA.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_ESP_WIFI_ENABLE_ROAMING_APP=y
CONFIG_ESP_WIFI_ROAMING_LOW_RSSI_ROAMING=y
CONFIG_ESP_WIFI_ROAMING_LOW_RSSI_THRESHOLD=-72
CONFIG_ESP_WIFI_ROAMING_PERIODIC_SCAN_MONITOR=n
CONFIG_ESP_WIFI_ROAMING_LEGACY_ROAMING=y
CONFIG_ESP_WIFI_ROAMING_NETWORK_ASSISTED_ROAM=n
